import matplotlib.pyplot as plt
import numpy as np

# 項目和數值
items = ['V2', 'V3', 'V4']
# values = {'1x1': [2.5856, 0.0736, 0.0761, 0.0741], '2x2': [2.5572, 0.0244, 0.0302, 0.0249], '4x4': [2.5436, 0.0081, 0.0093, 0.0078], '8x8': [2.5448, 0.0048, 0.0050, 0.0049], '16x16': [2.5475, 0.0048, 0.0050, 0.0049], '32x32': [2.5505, 0.0049, 0.0058, 0.0051]}
values = {'1x1': [0.0736, 0.0761, 0.0741], '2x2': [0.0244, 0.0302, 0.0249], '4x4': [0.0081, 0.0093, 0.0078], '8x8': [ 0.0048, 0.0050, 0.0049], '16x16': [0.0048, 0.0050, 0.0049], '32x32': [0.0049, 0.0058, 0.0051]}
#values = {'256x256': [0.1531, 0.0003, 0.0004, 0.0004], '512x512': [0.6253, 0.0013, 0.0015, 0.0013], '1024x1024': [2.5505, 0.0049, 0.0058, 0.0051], '2048x2048': [10.4893, 0.0215, 0.0232, 0.0224]}
# values = {'256x256': [ 0.0003, 0.0004, 0.0004], '512x512': [0.0013, 0.0015, 0.0013], '1024x1024': [0.0049, 0.0058, 0.0051], '2048x2048': [0.0215, 0.0232, 0.0224]}
x = np.arange(len(items))  # 標籤位置
width = 0.15  # 條形寬度

fig, ax = plt.subplots()

# 為每個比較數值生成一個條形圖
rects = []
for i, (label, value) in enumerate(values.items()):
    rects.append(ax.bar(x - 2*width + i*width, value, width, label=label))

# 添加文字，標籤，標題和圖例
ax.set_ylabel('processing time(s)')
ax.set_title('Different Block Size')
ax.set_xticks(x)
ax.set_xticklabels(items)
ax.legend()

fig.tight_layout()

plt.show()
